app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Alex"], ["email", ""], ["password", ""], ["created_at", "2015-01-30 20:15:37.718600"], ["updated_at", "2015-01-30 20:15:37.718600"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$saA.TyXOyqJwE0FW.w9khe6W15jeDxQ0h3ZHg1KJdAn3DJUHEsYYq"], ["updated_at", "2015-02-02 00:27:37.139133"], ["id", 1]]